//=============================================================================
// スコア処理 [layout.h]
// Author:Kobayashi/小林 将兵
//=============================================================================
#ifndef _LAYOUT_H_
#define _LAYOUT_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLayout(void);
void UninitLayout(void);
void UpdateLayout(void);
void DrawLayout(void);

#endif
