//=============================================================================
// 制限時間の処理 [timer.h]
// Author:Kobayashi/小林 将兵
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

#include "main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	int nCounter;	//状態管理のカウンター
	int nTime;		//タイム
}TIMER;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);

TIMER *GetTimer(void);

#endif
