//=========================================================================
// リザルト処理 [result.h]
// Kobayashi Syouhei / 小林将兵
//=========================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=========================================================================
//プロトタイプ宣言
//=========================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif