//=========================================================================
// リザルト画面の処理 [result.h]
// Author:Kobayashi/小林 将兵
//=========================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=========================================================================
//プロトタイプ宣言
//=========================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif