//=============================================================================
// 制限時間の処理 [timer.h]
// Author:Kobayashi/小林 将兵
//=============================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);

#endif
