//=========================================================================
// タイトル画面の処理 [title.h]
// Author:Kobayashi/小林 将兵
//=========================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//=========================================================================
//プロトタイプ宣言
//=========================================================================
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif